docs/notes/polymorphism.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Polymorphism</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Polymorphism</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3b29d02">Definitions</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org3b29d02" class="outline-2">
<h2 id="org3b29d02"><a href="#org3b29d02">Definitions</a></h2>
<div class="outline-text-2" id="text-org3b29d02">
<blockquote>
<p>
associating an operation name with more than one algorithm
</p>
</blockquote>

<p>
in <a href="https://www.braveclojure.com/multimethods-records-protocols/">Clojure for the Brave and True</a>. It continues:
</p>

<blockquote>
<p>
For example, the algorithm for performing <code>conj</code> on a list is different from
the one for vectors, but we unify them under the same name to indicate that
they implement the same concept&#x2026;
</p>
</blockquote>
</div>
</div>
</div>
</body>
</html>